; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v5 - type_2 ?v3 - type_1)
 	      (pred_4 ?v2 - object ?v3 - type_1)
	      (pred_3 ?v5 - type_2 ?v8 - type_3)
	      (pred_2 ?v5 - type_2 ?v2 - object ?v8 - type_3))

   (:action op_2
       :parameters  (?v5 - type_2 ?v6 ?v4 - type_1)
       :precondition (and  (pred_1 ?v5 ?v6))
       :effect (and  (pred_1 ?v5 ?v4)
		     (not (pred_1 ?v5 ?v6))))

   (:action op_3
       :parameters (?v5 - type_2 ?v7 - object ?v1 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v7 ?v1) (pred_1 ?v5 ?v1) (pred_3 ?v5 ?v8))
       :effect (and (pred_2 ?v5 ?v7 ?v8)
		    (not (pred_4 ?v7 ?v1)) 
		    (not (pred_3 ?v5 ?v8))))

   (:action op_1
       :parameters (?v5 - type_2 ?v7 - object ?v1 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_2 ?v5 ?v7 ?v8) (pred_1 ?v5 ?v1))
       :effect (and (pred_4 ?v7 ?v1)
		    (pred_3 ?v5 ?v8)
		    (not (pred_2 ?v5 ?v7 ?v8)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_08 - type_2
obj_03 obj_07 - type_3
obj_04 obj_02 obj_01 - type_1
obj_05 obj_06 obj_09 - object)
(:init
(pred_1 obj_08 obj_01)
(pred_3 obj_08 obj_03)
(pred_3 obj_08 obj_07)
(pred_4 obj_05 obj_01)
(pred_4 obj_06 obj_01)
(pred_4 obj_09 obj_02)
)
(:goal
(and
(pred_4 obj_05 obj_01)
(pred_4 obj_06 obj_02)
(pred_4 obj_09 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_08 ?b obj_07))))
)
)

; plan
1. (op_3 obj_08 obj_06 obj_01 obj_03)
   deleted: (pred_4 obj_06 obj_01) (pred_3 obj_08 obj_03)
   added: (pred_2 obj_08 obj_06 obj_03)
   goals met: 1 of 3
2. (op_2 obj_08 obj_01 obj_02)
   deleted: (pred_1 obj_08 obj_01)
   added: (pred_1 obj_08 obj_02)
   goals met: 1 of 3
3. (op_1 obj_08 obj_06 obj_02 obj_03)
   deleted: (pred_2 obj_08 obj_06 obj_03)
   added: (pred_4 obj_06 obj_02) (pred_3 obj_08 obj_03)
   goals met: 2 of 3
4. (op_3 obj_08 obj_09 obj_02 obj_03)
   deleted: (pred_4 obj_09 obj_02) (pred_3 obj_08 obj_03)
   added: (pred_2 obj_08 obj_09 obj_03)
   goals met: 2 of 3
5. (op_2 obj_08 obj_02 obj_01)
   deleted: (pred_1 obj_08 obj_02)
   added: (pred_1 obj_08 obj_01)
   goals met: 2 of 3
6. (op_1 obj_08 obj_09 obj_01 obj_03)
   deleted: (pred_2 obj_08 obj_09 obj_03)
   added: (pred_4 obj_09 obj_01) (pred_3 obj_08 obj_03)
   goals met: 3 of 3
